In [1]:
# Dependencies
import pandas as pd
import matplotlib.pyplot as plt
import databaseconfig as cfg
import sqlalchemy as db
import psycopg2


# Read database
engine = db.create_engine(f"postgresql+psycopg2://{cfg.user}:{cfg.password}@localhost:5432/{cfg.database}")
metadata = db.MetaData()
connection = engine.connect()

In [6]:
# Get salary_analysis
salaries = db.Table('salaries',metadata,autoload=True,autoload_with=engine)
results = connection.execute(db.select([salaries])).fetchall()
salariesdf= pd.DataFrame(results)
salariesdf.columns = results[0].keys()
salariesdf.head()

   id  emp_no  salary   from_date     to_date
0   1   10001   60117  1986-06-26  1987-06-26
1   2   10002   65828  1996-08-03  1997-08-03
2   3   10003   40006  1995-12-03  1996-12-02
3   4   10004   40054  1986-12-01  1987-12-01
4   5   10005   78228  1989-09-12  1990-09-12

In [12]:
# Get title_salary_analysis
titles = db.Table('title_salary_analysis',metadata,autoload=True,autoload_with=engine)
title_results = connection.execute(db.select([titles])).fetchall()
titlesdf= pd.DataFrame(title_results)
titlesdf.columns = title_results[0].keys()
titlesdf

,title,avg_salary,min_salary,max_salary,salary_range,std_salary,var_salary,num_salaries
0,Assistant Engineer,48493.20,40000,102288,62288,10247.59,105013169.28,15128
1,Engineer,48539.78,40000,110449,70449,10316.46,106429248.59,115003
2,Manager,51531.04,40000,72446,32446,12068.13,145639730.91,24
3,Senior Engineer,48506.75,40000,110449,70449,10252.36,105110978.63,97750
4,Senior Staff,58503.29,40000,129492,89492,16505.51,272431927.11,92853
5,Staff,58465.27,40000,129492,89492,16499.35,272228422.60,107391
6,Technique Leader,48580.51,40000,104065,64065,10313.49,106367996.12,15159